"HYPOTHESIS: The mother agent may be waiting indefinitely for some event or response from scenario agents that never comes, causing a deadlock. Since stream handling is working fine, the issue likely involves:\n1. Missing or incorrect cleanup of scenario agent processes\n2. An unresolved Promise in the communication between mother and scenario agents\n3. Event listeners that aren't properly removed\n\nCONFIRMED: Yes\n\nINVESTIGATION:\n- Focused on process management and Promise resolution, avoiding stream handling which was confirmed working\n- Analyzed communication patterns between mother and scenario agents\n- Found several critical issues in process management and Promise resolution\n\nKey findings:\n1. Mother agent is creating Promises for scenario agent completion but not properly handling rejection cases\n2. No timeout mechanism exists for scenario agent responses\n3. Process cleanup is triggered but might not complete due to unresolved Promises\n4. Event listeners for inter-process communication aren't being cleaned up consistently\n\nThe code shows a classic case of Promise chains that can remain unresolved if a scenario agent fails silently or exits unexpectedly. The mother agent continues waiting for resolution that never comes.\n\nCHANGES MADE:\n1. Added timeout mechanism for scenario agent responses\n2. Implemented proper Promise rejection handling\n3. Added cleanup for orphaned event listeners\n4. Implemented process termination confirmation\n\nThese changes ensure that:\n- No Promise can remain unresolved indefinitely\n- Failed processes are properly cleaned up\n- Event listeners are removed when no longer needed\n- Mother agent can recover from scenario agent failures\n\nCONFIDENCE: High\nThe investigation directly revealed issues matching the hypothesis:\n- Found multiple instances of unhandled Promise rejections\n- Discovered event listeners that weren't being properly cleaned up\n- Identified missing process termination confirmation\nThe fixes address the core issues while maintaining the working stream handling."